{
  "name": "Apprisen Credit Counseling",
  "description": "Apprisen is an accredited nonprofit credit counseling organization dedicated to helping people improve their financial well-being through comprehensive financial education, coaching, and counseling services. They offer debt management programs, credit health education, financial health planning, bankruptcy counseling, housing counseling, and student loan education. Apprisen provides personalized financial guidance in a confidential, non-judgmental atmosphere, serving Kentucky residents through multiple locations and online services.",
  "source": "Verified from official website, Google Business listing, 211.org directory, and multiple online sources",
  "phone": "(800) 355-2227",
  "email": "info@apprisen.com",
  "website": "https://www.apprisen.com",
  "address1": "2265 Harrodsburg Road Suite 303",
  "city": "Lexington",
  "state": "KY",
  "postal_code": "40504",
  "county": "Fayette",
  "hours_of_operation": "Monday-Thursday 8:00 AM-7:00 PM EST, Friday 8:00 AM-6:00 PM EST, Saturday 10:00 AM-2:00 PM EST, Sunday Closed",
  "is_emergency_service": false,
  "is_24_hour_service": false,
  "eligibility_requirements": "Open to all individuals seeking financial counseling and debt management assistance",
  "populations_served": "Individuals and families seeking financial counseling, debt management, and credit education",
  "cost_information": "Some services offered at reduced fees or free of charge for individuals in need",
  "languages_available": "English",
  "notes": "VERIFIED INFORMATION: All contact information verified on 2024-01-15. CITATIONS: Contact information verified from official website https://www.apprisen.com. Services and programs verified from main website and Google Business listing. Phone number (800) 355-2227 confirmed working. Address 2265 Harrodsburg Road Suite 303, Lexington, KY 40504 verified across multiple sources. Hours of operation verified from Google AI overview and business listing. Organization is a 501(c)(3) nonprofit with BBB A+ rating. Additional locations in Louisville (502-458-8840) and Florence (859-283-9617). Services include debt management programs, credit counseling, financial education, bankruptcy counseling, and housing counseling. Also offers online services through IRIS platform.",
  "service_type_ids": [2, 15, 23]
}
