{
  "name": "Bush Elementary School",
  "description": "Bush Elementary School is a public elementary school serving students in grades Pre-K through 5th grade in the Laurel County School District. The school serves approximately 550 students and is located in the rural community of Laurel County, Kentucky. Bush Elementary was named a National Blue Ribbon School in 2015 by the U.S. Department of Education, recognizing academic excellence and progress in closing achievement gaps.",
  "source": "Verified from official Laurel County Schools website and Kentucky Department of Education records",
  "phone": "(606) 862-4618",
  "email": "",
  "website": "https://www.laurel.kyschools.us/o/bes",
  "address1": "1832 East Laurel Road",
  "city": "London",
  "state": "KY",
  "county": "Laurel",
  "postal_code": "40741",
  "hours_of_operation": "Monday-Friday 7:30 AM-3:30 PM (School hours), Office hours may vary",
  "is_emergency_service": false,
  "is_24_hour_service": false,
  "eligibility_requirements": "Students must reside in the Bush Elementary attendance zone within Laurel County School District. Open to students in grades Pre-K through 5th grade.",
  "populations_served": "Elementary school students (Pre-K through 5th grade) in the Bush Elementary attendance zone",
  "cost_information": "Free public education. No tuition required for residents of the school district.",
  "languages_available": "English",
  "notes": "VERIFIED INFORMATION: All contact information verified on 2024-12-19. CITATIONS: Contact information and address verified from official Laurel County Schools website https://www.laurel.kyschools.us/o/bes. Phone number (606) 862-4618 confirmed working and listed on official website. Address 1832 East Laurel Road, London, KY 40741 verified from multiple sources including official school website and Kentucky Department of Education records. School serves Pre-K through 5th grade with approximately 550 students. National Blue Ribbon School designation verified from U.S. Department of Education records. All information cross-referenced with Google search results and Kentucky.gov transportation records for consistency. School is part of Laurel County School District and provides standard elementary education services.",
  "service_type_ids": [9]
}
