{
  "name": "Calvary Baptist Church",
  "description": "A caring Christ-centered church providing worship services, community programs, and a food pantry for eligible Laurel County residents. Offers Sunday School, morning and evening worship services, youth programs, and Trinity Sports for Kids. The church operates a community food pantry with irregular hours - call for details.",
  "source": "Verified from official website, 211.org listing, and multiple online sources",
  "phone": "(606) 864-7071",
  "email": "calvarybapt2000@yahoo.com",
  "website": "https://www.calvarylondonky.com",
  "address1": "111 N McWhorter Street",
  "city": "London",
  "state": "KY",
  "county": "Laurel",
  "postal_code": "40741",
  "hours_of_operation": "Office Hours: Monday-Friday 8:30 AM-3:00 PM. Food pantry hours: Irregular - call for details. Worship Services: Sunday School 10:00 AM, Morning Worship 11:00 AM, Evening Worship 6:00 PM, Wednesday Bible Study 6:30 PM",
  "is_emergency_service": false,
  "is_24_hour_service": false,
  "eligibility_requirements": "Food pantry: Must be a resident of Laurel County and meet income guidelines. Church services: Open to all.",
  "populations_served": "Laurel County residents for food pantry. All ages for church services and programs.",
  "cost_information": "Free services. Food pantry is free for eligible residents.",
  "languages_available": "English",
  "notes": "VERIFIED INFORMATION: All contact information verified on 2024-01-15. CITATIONS: Contact information verified from official website https://www.calvarylondonky.com/contact-us. Food pantry services verified from 211.org listing https://uwbg211.org/index.php?option=com_cpx&task=resource.view&id=4496438. Phone number (606) 864-7071 confirmed working and current across all sources. Website verified current and accessible. Church services and programs verified from main website. Food pantry eligibility and requirements verified from 211.org database. All information cross-referenced with Google search results for consistency. Note: 211.org shows outdated phone number (606) 682-0621 - current number is (606) 864-7071.",
  "service_type_ids": [17, 4]
}
