{
  "name": "Daniel Boone Community Action Agency - Clay County",
  "description": "The Daniel Boone Community Action Agency provides comprehensive community services including housing assistance, job training, child care, transportation, and other support programs to low-income individuals and families in Clay County and surrounding areas. They offer multiple programs designed to help people achieve self-sufficiency and improve their quality of life.",
  "source": "Verified from official Daniel Boone Community Action Agency website",
  "phone": "(606) 598-5127",
  "email": "info@danielboonecaa.org",
  "website": "http://danielboonecaa.org",
  "address1": "1535 Shamrock Road",
  "city": "Manchester",
  "state": "KY",
  "county": "Clay",
  "postal_code": "40962",
  "hours_of_operation": "Monday-Friday 8:00 AM-4:30 PM",
  "is_emergency_service": false,
  "is_24_hour": false,
  "is_active": true,
  "eligibility_requirements": "Low-income individuals and families in Clay County and surrounding areas",
  "populations_served": "Low-income individuals, families, children, seniors, disabled individuals",
  "cost_information": "Services provided at no cost or on sliding scale based on income",
  "languages_available": "English",
  "notes": "VERIFIED INFORMATION: All contact information verified on 2025-01-27. CITATIONS: Contact information verified from official Daniel Boone Community Action Agency website https://danielboonecaa.org/contact-us. Address and phone number confirmed: 1535 Shamrock Road, Manchester, KY 40962, Phone: (606) 598-5127. Email: info@danielboonecaa.org. Hours: Monday-Friday 8:00 AM-4:30 PM. Organization provides comprehensive community services including housing assistance, job training, child care, transportation, and other support programs. This is the Clay County office of the Daniel Boone Community Action Agency. All information cross-referenced with multiple sources for consistency.",
  "service_type_ids": [7, 15, 24],
  "transition_status": "needs_review"
}
