{
  "name": "Cumberland River Comprehensive Care Center",
  "description": "Comprehensive behavioral health center providing outpatient mental health services, substance abuse treatment, crisis intervention, and developmental disability services. Offers individual, group, and family counseling, psychiatric evaluation, medication management, and residential programs. Serves Bell, Clay, Harlan, Jackson, Knox, Laurel, Rockcastle, and Whitley counties with multiple locations throughout the region.",
  "source": "Verified from official website and multiple authoritative sources",
  "phone": "(606) 549-1440",
  "email": "",
  "website": "https://crbhky.org",
  "address1": "285 Cemetery Road",
  "city": "Williamsburg",
  "state": "KY",
  "county": "Whitley",
  "postal_code": "40769",
  "hours_of_operation": "Monday 8:00 AM-4:30 PM, Tuesday 8:00 AM-6:30 PM, Wednesday 8:00 AM-6:30 PM, Thursday 8:00 AM-4:30 PM, Friday 8:00 AM-4:30 PM",
  "is_emergency_service": true,
  "is_24_hour_service": false,
  "eligibility_requirements": "Services available to all age groups. Individuals may seek services on their own or may be referred by a primary care provider. Payment based on ability to pay. Serves residents of Bell, Clay, Harlan, Jackson, Knox, Laurel, Rockcastle, and Whitley counties.",
  "populations_served": "Adults, children, adolescents, families, individuals with mental health needs, substance abuse issues, developmental disabilities, and intellectual disabilities",
  "cost_information": "Payment based on ability to pay. Services are confidential and sensitive to cultural needs and differences.",
  "languages_available": "English, ASL interpreter services available for Deaf and Hard of Hearing individuals",
  "notes": "VERIFIED INFORMATION: All contact information verified on 2024-01-15. CITATIONS: Contact information verified from official website https://crbhky.org/locations/. Organization details verified from main website https://crbhky.org. Phone number (606) 549-1440 confirmed working and listed on official website. Website verified current and accessible. Organization information cross-referenced with FindHelp.org, Yelp, Healthgrades, and other authoritative sources. Multiple locations confirmed: Williamsburg (285 Cemetery Road), Corbin (1203 American Greeting Rd), London (915 N. Laurel Road), Harlan (134 Comprehensive Drive), and others. Services include crisis intervention, outpatient mental health, substance abuse treatment, children's services, and developmental disability programs. 24-hour crisis line available at 606-526-9552. All information verified from authoritative sources.",
  "service_type_ids": [6, 12, 13, 20, 21, 22]
}
