{
  "name": "Dismas Charities Manchester",
  "description": "Dismas Charities Manchester provides residential rehabilitation services to men and women releasing from state and federal incarceration. Founded in 1964, Dismas Charities has been healing the human spirit for over 60 years, helping individuals develop the skills and support needed to re-enter society as contributing members. The organization focuses on ending the cycle of victimization through comprehensive rehabilitation programs and transitional support services.",
  "source": "Verified from official website, Google Business listing, and multiple online directories",
  "phone": "(606) 598-5555",
  "website": "https://dismas.com/",
  "address1": "845 Muddy Gap Rd",
  "city": "Manchester",
  "state": "KY",
  "county": "Clay",
  "postal_code": "40962",
  "hours_of_operation": "Monday-Friday 8:00 AM-5:00 PM",
  "is_emergency_service": false,
  "is_24_hour_service": false,
  "eligibility_requirements": "Men and women releasing from state and federal incarceration, must be referred through the criminal justice system",
  "populations_served": "Individuals transitioning from incarceration back to society",
  "cost_information": "Contact for specific cost information and available assistance programs",
  "languages_available": "English",
  "notes": "VERIFIED INFORMATION: All contact information verified on 2024-01-15. CITATIONS: Contact information verified from official website https://dismas.com/facilities/index.html. Phone number (606) 598-5555 confirmed from official website facilities page, Google Business listing, and multiple directory listings. Address 845 Muddy Gap Rd, Manchester, KY 40962 verified from official website, Google Maps, and multiple sources. Organization name corrected from 'Dismis' to 'Dismas' based on official sources. Hours of operation verified from FindHelp.org listing. Organization founded in 1964 by Father William Diersen, serves over 35 centers in 14 states. Mission focuses on healing the human spirit and helping individuals re-enter society after incarceration. All information cross-referenced with multiple sources for consistency.",
  "service_type_ids": [19, 21, 8]
}
