{
  "name": "Dorthae Pentecostal Church",
  "description": "Dorthae Pentecostal Church operates the Helping Hands Food Pantry and Clothing Ministry, providing food assistance and clothing to low-income residents in the Corbin area. The church has been serving the community since 1934 and offers multiple ministries including food pantry services, clothing assistance, Celebrate Recovery support groups, and various prayer meetings. The food pantry and clothing ministry are open on Mondays and Thursdays from 10:00 AM to 12:00 PM.",
  "source": "Verified from official Dorthae Pentecostal Church website and multiple online directories",
  "phone": "(606) 656-3721",
  "email": "dpcfamilylifecenter@gmail.com",
  "website": "https://www.dorthae.org/",
  "address1": "2381 N. Hwy 1223",
  "city": "Corbin",
  "state": "KY",
  "county": "Whitley",
  "postal_code": "40701",
  "hours_of_operation": "Food Pantry and Clothing Ministry: Monday and Thursday 10:00 AM - 12:00 PM. Church Services: Sunday School 10:00 AM, Sunday Worship 11:00 AM, Sunday Evening 6:00 PM, Wednesday Evening 7:00 PM",
  "is_emergency_service": false,
  "is_24_hour": false,
  "is_active": true,
  "eligibility_requirements": "Open to low-income residents in the Corbin area. Families may shop for clothing once per month.",
  "populations_served": "Low-income residents of Corbin and surrounding areas, particularly Knox County residents",
  "cost_information": "Free - no cost for food pantry services or clothing assistance",
  "languages_available": "English",
  "notes": "VERIFIED INFORMATION: All contact information verified on 2024-01-15. CITATIONS: Contact information verified from official Dorthae Pentecostal Church website https://www.dorthae.org/. Phone number (606) 656-3721 confirmed as church number. Alternative contact number (606) 528-9416 also listed on website. Address 2381 N. Hwy 1223, Corbin, KY 40701 verified from official website. Website verified current and accessible. Food pantry services confirmed from official website ministries page and multiple online directories including FindHelp.org and uwbg211.org. Helping Hands Food Pantry and Clothing Ministry operates Monday and Thursday 10:00 AM - 12:00 PM. Church established in 1934. All information cross-referenced with Google search results and multiple directories for consistency. Church serves Corbin area and surrounding communities.",
  "service_type_ids": [17, 4, 2]
}
