{
  "name": "Family Options",
  "description": "Faith-based compassionate mental health counseling practice providing effective outpatient, individualized therapeutic care. We treat mental health disorders related to aging and disease, and provide a neutral ground for individuals who want to explore treatment options. Our focus is to help individuals heal, energize, and become aware of their inner strengths through depression and anxiety treatment, living in the moment therapy, and spiritual and grief comfort related to aging and disease.",
  "source": "Verified from official website and multiple sources",
  "phone": "(606) 682-3182",
  "email": "debbie@familyopts.com",
  "website": "http://www.familyopts.com",
  "address1": "225 Substation Street",
  "city": "London",
  "state": "KY",
  "county": "Laurel",
  "postal_code": "40741",
  "hours_of_operation": "By appointment only. Closed Friday, Saturday & Sunday.",
  "is_emergency_service": false,
  "is_24_hour_service": false,
  "eligibility_requirements": "Serving the 55 and older population. Accepts some insurances and private pay clients.",
  "populations_served": "Senior adults 55 and older, individuals seeking mental health counseling",
  "cost_information": "Accepts some insurances and private pay clients",
  "languages_available": "English",
  "notes": "VERIFIED INFORMATION: All contact information verified on 2024-01-15. CITATIONS: Contact information verified from official website http://www.familyopts.com. Phone number (606) 682-3182 confirmed current and matches Google search results. Address and services verified from website. Original phone numbers in resource (6066219800 and 6063924113) do not return any search results and appear to be invalid. Organization is Family Options - Developmental Planning, LLC, a faith-based mental health counseling practice in London, KY. Services include depression and anxiety treatment, living in the moment therapy, and spiritual and grief comfort related to aging and disease. Counselor: Debbie Gilbert, LPCC, PhD Candidate. All information cross-referenced with Google search results for consistency.",
  "service_type_ids": [20]
}

