{
  "name": "First Christian Church of Corbin",
  "description": "Historic Christian Church (Disciples of Christ) congregation founded in 1892, offering worship services, Sunday school, Bible study, youth programs, and community outreach including food assistance programs. Provides traditional worship with pipe organ music, children's programs, and various community services.",
  "source": "Verified from official website and multiple online sources",
  "phone": "(606) 528-1655",
  "email": "officefcc@bellsouth.net",
  "website": "https://www.fcccorbin.com/",
  "address1": "100 South Kentucky Avenue",
  "city": "Corbin",
  "state": "KY",
  "county": "Whitley County",
  "postal_code": "40701",
  "hours_of_operation": "Sunday School 9:30 AM, Sunday Worship 10:30 AM, Wednesday Faith Quest 5:30 PM, Wednesday Bible Study 6:00 PM",
  "is_emergency_service": false,
  "is_24_hour_service": false,
  "eligibility_requirements": "Open to all seeking Christian fellowship and worship",
  "populations_served": "All ages, families, individuals seeking spiritual guidance",
  "cost_information": "Free services and programs",
  "languages_available": "English",
  "notes": "VERIFIED INFORMATION: All contact information verified on 2024-01-15. CITATIONS: Contact information and services verified from official website https://www.fcccorbin.com/. Phone number (606) 528-1655 confirmed working and matches original record. Address verified from official website and multiple online directories. Church founded in 1892, current building constructed in 1926 and listed on National Register of Historic Places. Services include Sunday worship, Sunday school, Wednesday youth programs, Bible study, and community outreach. Church operates the Corbin Community Backpack Program providing food for 1,100 local school children. Offers free sewing classes, emergency food assistance, and various community programs. Historic church with 99-year-old pipe organ, accessible facilities, and active congregation.",
  "service_type_ids": [17, 4]
}
