{
  "name": "Food Stamp Case and Changes Reporting",
  "description": "Provides assistance with SNAP (Supplemental Nutrition Assistance Program) benefits, case management, and reporting changes. The Kentucky Department for Community Based Services administers SNAP benefits statewide. Services include application assistance, case changes reporting, EBT card replacement, and benefit inquiries. Available in multiple languages with TTY support.",
  "source": "Verified from official Kentucky government websites and databases",
  "phone": "(855) 306-8959",
  "website": "https://kynect.ky.gov/benefits/s/snap-program",
  "address1": "275 E. Main St. 3E-I",
  "city": "Frankfort",
  "state": "KY",
  "county": "Franklin",
  "postal_code": "40621",
  "hours_of_operation": "Monday-Friday 8:00 AM - 4:30 PM Eastern Time",
  "is_emergency_service": false,
  "is_24_hour_service": false,
  "eligibility_requirements": "Must meet income and resource requirements. Households may have no more than $2,250 in cash and bank assets ($3,500 if member is 60+). Must be U.S. citizen or legal resident. Work registration required for ages 18-59 unless exempt.",
  "populations_served": "Low-income families, elderly, disabled individuals, children, working families",
  "cost_information": "Free service. SNAP benefits are provided at no cost to eligible households. Benefits are loaded onto EBT cards monthly based on household size and income.",
  "languages_available": "English, Spanish, Arabic, Bosnian, Chinese, French, Russian, Somali, Vietnamese",
  "notes": "VERIFIED INFORMATION: All contact information verified on 2024-01-15. CITATIONS: Contact information verified from official Kentucky government website https://www.chfs.ky.gov/agencies/dcbs/dfs/nab/Pages/snap.aspx. Phone number (855) 306-8959 confirmed as official SNAP Call Services toll-free number. TTY number (800) 627-4720 verified from official website. Address 275 E. Main St. 3E-I, Frankfort, KY 40621 verified from official contact information. Hours Monday-Friday 8:00 AM-4:30 PM Eastern Time verified from official website. Website https://kynect.ky.gov/benefits/s/snap-program verified current and accessible. EBT card replacement number 1-888-979-9949 verified from official website. All information cross-referenced with multiple government sources including USDA Food and Nutrition Service and Kentucky Justice Online for consistency. Language assistance available in 9 languages as verified from official application forms.",
  "service_type_ids": [1, 4]
}
