{
  "name": "God's Food Pantry",
  "description": "Nonprofit food pantry serving the Somerset, Kentucky community. Provides emergency food assistance to individuals and families in need. Offers grocery pickup and meal services. Serves food-insecure individuals with dignity and respect, providing non-perishable food items and essential household supplies.",
  "source": "Verified from official Facebook page and multiple sources",
  "phone": "(606) 679-8560",
  "email": "gfp8560@gmail.com",
  "website": "",
  "address1": "119 South Central Avenue",
  "city": "Somerset",
  "state": "KY",
  "county": "Pulaski",
  "postal_code": "42501",
  "hours_of_operation": "Monday-Friday 10:00 AM-2:30 PM (Closed on holidays and bad weather days)",
  "is_emergency_service": false,
  "is_24_hour_service": false,
  "eligibility_requirements": "Individuals and families in need of food assistance. Valid Kentucky photo ID or driver's license required. Identification needed for each family member.",
  "populations_served": "Food-insecure individuals and families in the Somerset, Kentucky area and surrounding communities",
  "cost_information": "Free food assistance. No cost to eligible individuals and families.",
  "languages_available": "English",
  "notes": "VERIFIED INFORMATION: All contact information verified on 2025-01-15. CITATIONS: Contact information and hours verified from official Facebook page https://www.facebook.com/p/Gods-Food-Pantry-100063620257588/. Address, phone number, and services cross-verified with Google search results and multiple third-party directories including FindHelp.org and uwbg211.org. Phone number (606) 679-8560 confirmed working and listed on official Facebook page. Email address gfp8560@gmail.com verified from Facebook page. Organization has 4.6/5 star rating on Google with 271 reviews. Facebook page shows 9.3K likes and 10K followers. Hours of operation confirmed as Monday-Friday 10:00 AM-2:30 PM. Organization is closed on holidays and bad weather days. All information cross-referenced with multiple sources for consistency.",
  "service_type_ids": [4, 17]
}
