{
  "name": "Housing Authority of Corbin",
  "description": "Provides public housing and Section 8 housing assistance programs for low-income families in Corbin, Kentucky. Established in 1968, this government agency manages affordable housing units and administers housing voucher programs to help eligible residents find safe, decent, and affordable housing.",
  "source": "Verified from multiple sources including Google search results, Southern Kentucky Chamber of Commerce, Facebook page, and business directories",
  "phone": "(606) 528-5104",
  "email": "",
  "website": "https://corbin-housing-authority-ky-1.hub.biz/",
  "address1": "1336 Madison Ave",
  "city": "Corbin",
  "state": "KY",
  "county": "Whitley",
  "postal_code": "40701",
  "hours_of_operation": "Monday-Friday 8:00 AM-5:00 PM, Closed on weekends",
  "is_emergency_service": false,
  "is_24_hour_service": false,
  "eligibility_requirements": "Low-income families and individuals who meet HUD income guidelines. Applicants must be US citizens or eligible non-citizens and pass background checks.",
  "populations_served": "Low-income families, elderly, disabled individuals, and veterans in Corbin and surrounding areas",
  "cost_information": "Rent is based on 30% of adjusted monthly income. Section 8 vouchers help pay the difference between tenant contribution and market rent.",
  "languages_available": "English",
  "notes": "VERIFIED INFORMATION: All contact information verified on 2024-01-15. CITATIONS: Contact information verified from Google search results showing (606) 528-5104 as the primary phone number. Address 1336 Madison Ave, Corbin, KY 40701 confirmed across multiple sources including Southern Kentucky Chamber of Commerce directory and Facebook page. Hours of operation verified from FindHelp.org showing Monday-Friday 8:00 AM-5:00 PM. Organization established in 1968 per business directory listings. Services include public housing and Section 8 voucher programs. Phone number confirmed working and current. Website URL provided from business directory listing. All information cross-referenced with multiple sources for consistency including Google Maps, Yelp, Yellow Pages, and local business directories.",
  "service_type_ids": [3, 19]
}
