{
  "name": "Isaiah House",
  "description": "Kentucky's largest community-focused nonprofit addiction treatment organization offering Christ-centered addiction recovery programs across the state. Provides comprehensive substance abuse treatment including residential, intensive outpatient (IOP), and outpatient (OP) programs. Services include detox, medication-assisted treatment, counseling, education, workforce development, and recovery housing. Serves individuals struggling with substance use disorders with a holistic approach addressing physical, spiritual, educational, and occupational needs.",
  "source": "Verified from official website and multiple sources",
  "phone": "(859) 375-9200",
  "email": "",
  "website": "https://isaiah-house.org",
  "address1": "1090 Industry Road",
  "city": "Harrodsburg",
  "state": "KY",
  "county": "Mercer",
  "postal_code": "40330",
  "hours_of_operation": "Monday-Friday 8:00 AM-5:00 PM (Admissions open 24 hours)",
  "is_emergency_service": true,
  "is_24_hour_service": true,
  "eligibility_requirements": "Individuals struggling with substance use disorders. Programs available for both men and women. Insurance accepted, sliding scale available for those without insurance.",
  "populations_served": "Adults with substance use disorders, both men and women. Serves communities across Kentucky with multiple locations throughout the state.",
  "cost_information": "Accepts insurance. Sliding scale available for those without insurance. Contact for specific pricing and payment options.",
  "languages_available": "English",
  "notes": "VERIFIED INFORMATION: All contact information verified on 2025-01-15. CITATIONS: Contact information and program details verified from official website https://isaiah-house.org. Address, phone number, and services cross-verified with Google search results and multiple third-party directories. Phone number (859) 375-9200 confirmed working and listed on official website. Website verified current and accessible. Organization is Kentucky's largest community-focused nonprofit addiction treatment organization. Offers 24/7 admissions support. Multiple locations across Kentucky including Willisburg, Harrodsburg, Louisville, Lexington, Danville, Georgetown, and Hillview. Nationally accredited and licensed treatment center. All information cross-referenced with multiple sources for consistency.",
  "service_type_ids": [13, 21]
}
