{
  "name": "KFAN - Kentucky Food Action Network",
  "description": "Statewide network of individuals and organizations working to create accessible and resilient food systems in Kentucky. Focuses on fighting hunger and building power through advocacy, education, and collaboration. Provides trainings, hosts working groups on food assistance and agriculture, and helps develop food advocacy stories. Works with state and federal officials to improve food policy and nutrition assistance programs.",
  "source": "Verified from official website and multiple online sources",
  "phone": "Not provided",
  "email": "kyfoodaction@gmail.com",
  "website": "https://www.kyfoodactionnetwork.org",
  "address1": "Statewide network - no physical office",
  "city": "Statewide",
  "state": "KY",
  "county": "Statewide",
  "postal_code": "00000",
  "hours_of_operation": "Not specified",
  "is_emergency_service": false,
  "is_24_hour_service": false,
  "eligibility_requirements": "Open to any resident of Kentucky, Kentucky-based organizations, or regional/national allied organizations. Network membership is inclusive and welcomes all sectors of the food system.",
  "populations_served": "All Kentuckians, food-insecure populations, farmers and producers, BIPOC communities, individuals on public assistance",
  "cost_information": "Free to join network. No membership fees.",
  "languages_available": "English",
  "notes": "VERIFIED INFORMATION: All contact information verified on 2025-01-16. CITATIONS: Contact information verified from official website https://www.kyfoodactionnetwork.org/contact.html. Services and programs verified from main website https://www.kyfoodactionnetwork.org and about page https://www.kyfoodactionnetwork.org/about.html. Email kyfoodaction@gmail.com confirmed on contact page and social media links. Website verified current and accessible. Organization is a statewide network formed in 2019 with leadership from Community Farm Alliance, Feeding Kentucky, Kentucky Equal Justice Center, and Kentucky Center for Economic Policy. No physical office location - operates as a statewide network with staff from multiple partner organizations. Social media presence confirmed: Facebook, Twitter (@KYFoodAction), YouTube. All information cross-referenced with multiple sources including government documents and partner organization websites.",
  "service_type_ids": [4, 17]
}
