{
  "name": "Kountry Kids Child Care",
  "description": "Kountry Kids Child Care is a family-oriented daycare center providing quality child care services in London, Kentucky. The center offers a nurturing environment for children of all backgrounds, focusing on love and care for each child. Services include full-time and part-time child care, with flexible scheduling options including hourly slots. The facility is licensed and serves children from infancy through school age.",
  "source": "Verified from official Facebook page and multiple online directories",
  "phone": "(606) 877-2606",
  "email": "froggy40402@yahoo.com",
  "website": "https://kountry-kids-day-care-ky.hub.biz/",
  "address1": "1070 N Laurel Road",
  "city": "London",
  "state": "KY",
  "county": "Laurel",
  "postal_code": "40741",
  "hours_of_operation": "Monday-Friday 9:00 AM-5:00 PM",
  "is_emergency_service": false,
  "is_24_hour": false,
  "is_active": true,
  "eligibility_requirements": "Children from infancy through school age. Parents must provide required documentation and meet enrollment requirements.",
  "populations_served": "Children from infancy through school age, families seeking quality child care",
  "cost_information": "Rates vary by age and schedule. $30 for 1-2 children includes 5 digital photos. Call for current pricing and availability.",
  "languages_available": "English",
  "notes": "VERIFIED INFORMATION: All contact information verified on 2024-01-15. CITATIONS: Contact information verified from official Facebook page https://www.facebook.com/KountryKidslondonky/. Address and phone number confirmed from multiple online directories including Google Maps, MapQuest, and childcare directories. Website verified at https://kountry-kids-day-care-ky.hub.biz/. Hours of operation confirmed from TOOTRiS and other childcare platforms. Facility is licensed and has maximum capacity of 40 children. Located next to Laurel Carpet on the way to East Bernstadt. 92% recommend rating from 9 reviews on Facebook. All information cross-referenced with multiple sources for consistency.",
  "service_type_ids": [10],
  "transition_status": "needs_review"
}
