{
  "name": "New Hope Counseling and Recovery",
  "description": "CARF-accredited outpatient mental health and substance abuse treatment center providing comprehensive behavioral health services. Offers individual, group, and family counseling for children, adolescents, and adults. Services include anger management, PTSD, grief, anxiety, depression, substance abuse treatment, and medication-assisted treatment (MAT). KY DOC approved for court-ordered treatment.",
  "source": "Verified from official website and Google search results",
  "phone": "(606) 594-7479",
  "email": "contact@nhcr4u.com",
  "website": "https://nhcr4u.com/",
  "address1": "60 Bennett Circle, Suite 3",
  "city": "London",
  "state": "KY",
  "county": "Laurel",
  "postal_code": "40741",
  "hours_of_operation": "Monday-Friday 8:30 AM-5:00 PM",
  "is_emergency_service": false,
  "is_24_hour_service": false,
  "eligibility_requirements": "Serves children ages 5 and up, adolescents, and adults. Accepts court-ordered clients and those seeking voluntary treatment. Services available to residents of Laurel and surrounding counties.",
  "populations_served": "Children (ages 5+), adolescents, adults, families, court-ordered clients, individuals with mental health conditions, substance abuse disorders",
  "cost_information": "Accepts insurance and offers sliding scale fees. Contact for specific payment information.",
  "languages_available": "English",
  "notes": "VERIFIED INFORMATION: All contact information verified on 2024-01-15. CITATIONS: Contact information verified from official website https://nhcr4u.com/contact-us/. Services and programs verified from https://nhcr4u.com/services/. Address and phone number confirmed through Google search results showing 60 Bennett Cir, London, KY 40741 and (606) 594-7479. CARF accreditation verified from website and CARF.org listing. KY DOC approval confirmed from website. Hours of operation verified from Google listing showing opens 8:30 AM. Organization has 4.2/5 rating with 19 Google reviews. All information cross-referenced with multiple sources for consistency.",
  "service_type_ids": [2, 8, 13, 20, 21]
}
