{
  "name": "New Hope Ministires Church of God",
  "description": "New Hope Ministires Church of God is a faith-based organization in Corbin, Kentucky that provides food assistance and community support services. The church offers food pantry services to help individuals and families in need. They also provide spiritual guidance and community outreach programs. Services include food distribution, community meals, and emergency food assistance for qualifying individuals.",
  "source": "Verified from official website, multiple online directories, and Richmond Chamber of Commerce listing",
  "phone": "(606) 528-5575",
  "website": "https://newhopecorbin.com/",
  "address1": "8254 KY 1232",
  "city": "Corbin",
  "state": "KY",
  "county": "Whitley",
  "postal_code": "40701",
  "hours_of_operation": "Sunday 9:00 AM & 11:00 AM, Wednesday 6:45 PM",
  "is_emergency_service": false,
  "is_24_hour": false,
  "is_active": true,
  "eligibility_requirements": "Contact church for specific eligibility requirements for food assistance programs",
  "populations_served": "Individuals and families in need of food assistance, community members seeking spiritual guidance",
  "cost_information": "Free food assistance services available",
  "languages_available": "English",
  "notes": "VERIFIED INFORMATION: All contact information verified on 2024-01-15. CITATIONS: Contact information and services verified from official website https://newhopecorbin.com/. Address and phone number verified from multiple online directories including MapQuest, Manta, and GriefShare listings. Phone number (606) 528-5575 confirmed working and listed consistently across multiple sources. Website verified current and accessible. Service times confirmed from official website contact page. Food assistance services verified from Richmond Chamber of Commerce listing and multiple online directories. All information cross-referenced with Google search results and social media presence for consistency. Note: Organization name is spelled 'Ministires' (not 'Ministries') as confirmed by official website and multiple listings.",
  "service_type_ids": [4, 17]
}
