{
  "name": "Pinnacle Treatment Centers",
  "description": "Pinnacle Treatment Centers is a nationally recognized addiction treatment organization with over 135 locations across the U.S., including multiple facilities in Kentucky. They offer comprehensive, evidence-based addiction treatment including detox, residential rehab, outpatient care, and counseling services. Their Kentucky locations include Recovery Works London, Winchester Treatment Services, and Georgetown Medical.",
  "source": "Verified from official Pinnacle Treatment Centers website and search results",
  "phone": "1-857-466-2253",
  "website": "https://pinnacletreatment.com",
  "address1": "1317 Route 73, Suite 200",
  "city": "Mt. Laurel",
  "state": "NJ",
  "county": "Not provided",
  "postal_code": "08054",
  "hours_of_operation": "24/7 admissions available",
  "is_emergency_service": true,
  "is_24_hour_service": true,
  "eligibility_requirements": "Individuals seeking addiction treatment for alcohol or substance use disorders",
  "populations_served": "Individuals with alcohol and substance use disorders, including opioid, fentanyl, meth, cocaine, prescription drug, benzo, and Adderall addiction",
  "cost_information": "Accepts insurance, Medicaid, and offers payment options",
  "languages_available": "English, Spanish, and multiple other languages available",
  "notes": "VERIFIED INFORMATION: All contact information verified on 2025-01-22. CITATIONS: Contact information verified from official website https://pinnacletreatment.com. Phone number 1-857-466-2253 (85-PINNACLE) confirmed as main contact number. Corporate address 1317 Route 73, Suite 200, Mt. Laurel, NJ 08054 verified from website footer. Organization operates over 135 locations nationwide including multiple Kentucky facilities: Recovery Works London (300 Carrera Dr, London, KY 40741, (606) 260-8962), Winchester Treatment Services (1300 W Lexington Ave, Winchester, KY 40391, (859) 287-1098), and Georgetown Medical (105 Eastside Dr, Georgetown, KY 40324, (502) 868-0664). Officially recognized by CARF, NAATP, NABH, and RCPA. All information cross-referenced with official website and search results for accuracy.",
  "service_type_ids": [21]
}
