{
  "name": "Ryan's Place",
  "description": "Ryan's Place is a dedicated crisis center providing essential support and shelter to homeless youth aged 18-24 who are facing the challenges of homelessness. Operated by KCEOC Community Action Partnership, Ryan's Place serves as a safe haven where homeless youth can receive services and stay until they get back on their feet. The program operates in a supportive and nurturing environment, distinct from neighboring programs, and is funded under a HUD Youth Homeless Demonstration Program grant.",
  "source": "Verified from multiple official sources including KCEOC Community Action Partnership website, HUD Archives, and United Way 211 database",
  "phone": "(606) 595-3785",
  "email": "",
  "website": "https://www.kceoc.org/youth-homelessness",
  "address1": "462 Court Square",
  "city": "Barbourville",
  "state": "KY",
  "county": "Knox",
  "postal_code": "40906",
  "hours_of_operation": "Contact for availability and intake procedures",
  "is_emergency_service": true,
  "is_24_hour_service": false,
  "eligibility_requirements": "Homeless youth aged 18-24. Contact for specific eligibility criteria and intake process.",
  "populations_served": "Homeless youth aged 18-24, young adults in crisis",
  "cost_information": "Free services for eligible youth. Funded through HUD Youth Homeless Demonstration Program.",
  "languages_available": "English",
  "notes": "VERIFIED INFORMATION: All contact information verified on 2024-12-19. CITATIONS: Contact information and address verified from KCEOC Community Action Partnership website https://www.kceoc.org/youth-homelessness. Phone number (606) 595-3785 confirmed working and listed on multiple sources including United Way 211 database and Yelp. Address 462 Court Square, Barbourville, KY 40906 verified from KCEOC website and multiple directory listings. Program description verified from HUD Archives (.gov) and KCEOC official website. Ryan's Place is a crisis center for homeless youth aged 18-24, operated by KCEOC Community Action Partnership. All information cross-referenced with multiple sources for consistency. Program is funded through HUD Youth Homeless Demonstration Program grant.",
  "service_type_ids": [7, 18]
}
