{
  "name": "Volunteers of America Mid-States Freedom House",
  "description": "Comprehensive substance use disorder recovery program specifically designed for pregnant and parenting women, allowing children to stay with their mothers during treatment. Freedom House provides evidence-based clinical services with a focus on family-centered treatment, addressing the cycle of addiction while simultaneously treating mothers and supporting healthy child development. Services include individual and group therapy, medication-assisted treatment, parenting classes, life skills training, vocational support, and case management. The program has achieved significant success rates with 84% of Louisville clients and 96% of Manchester clients seeing increased visitations or reunification with their children.",
  "source": "Verified from official VOA Mid-States website and multiple third-party directories",
  "phone": "(502) 635-4530",
  "email": "intakears@voamid.org",
  "website": "https://www.voamid.org/locations/freedom-house/",
  "address1": "1436 Shelby Street",
  "city": "Louisville",
  "state": "KY",
  "postal_code": "40217",
  "county": "Jefferson",
  "hours": "24/7 - Open 24 hours",
  "eligibility": "Pregnant and parenting women with substance use disorder, children under 18 can stay with mothers during treatment",
  "services": "Substance use disorder treatment, medication-assisted treatment, individual and group therapy, parenting classes, life skills training, vocational support, case management, family reunification support, transitional housing for graduates",
  "notes": "Multiple locations: 1436 Shelby St, Louisville, KY 40217 and 1025 2nd St, Louisville, KY 40203. Manchester location available at 8467 N Hwy 421, Manchester, KY 40962 (606-658-8050). Program allows unlimited number of children under 18 to stay with mothers. Provides comprehensive family-centered treatment with 84-96% success rates for family reunification.",
  "categories": ["Mental Health", "Substance Abuse Treatment", "Housing", "Family Services"]
}
