{
  "name": "Bush Fire Department",
  "description": "The Bush Fire Department provides fire protection and emergency services to the Bush community in London, Kentucky. They operate 24/7 emergency response services and maintain multiple fire stations in the area. The department serves as a government organization providing essential public safety services.",
  "source": "Verified from official Bush Fire Department Facebook page and Google search results",
  "phone": "(606) 864-6663",
  "email": "bushfiredept@bushfd.net",
  "website": "http://www.bushfiredepartment.com",
  "address1": "60 Marydell Road",
  "city": "London",
  "state": "KY",
  "county": "Laurel",
  "postal_code": "40741",
  "hours_of_operation": "24 hours a day, 7 days a week for emergency services",
  "is_emergency_service": true,
  "is_24_hour": true,
  "is_active": true,
  "eligibility_requirements": "Emergency services available to all residents in service area",
  "populations_served": "Residents of Bush community and surrounding areas in London, Kentucky",
  "cost_information": "Emergency services provided at no cost to residents",
  "languages_available": "English",
  "notes": "VERIFIED INFORMATION: All contact information verified on 2025-01-27. CITATIONS: Contact information verified from official Bush Fire Department Facebook page https://www.facebook.com/p/Bush-Fire-Department-100057405072081/. Address and phone number confirmed from Facebook page: 60 Marydell Road, London, KY 40741-8619, Phone: (606) 864-6663, Email: bushfiredept@bushfd.net. Additional location information verified from Google search results showing multiple stations including Station #3 at 733-1165 E Laurel Rd. Website listed as bushfiredepartment.com but appears to be non-functional. Department operates as government organization providing 24/7 emergency fire protection services. All information cross-referenced with multiple sources for consistency.",
  "service_type_ids": [14],
  "transition_status": "needs_review"
}
