{
  "name": "Cross Roads Fire Department",
  "description": "Cross Roads Volunteer Fire Department is a volunteer fire department serving Northern Laurel County, Kentucky for over 35 years. The department provides emergency fire response, wildland firefighting, and community fire safety education. They serve in honor of Chief Basil Vaughn who died on a wildland fire in November 1987. The department operates 24/7 for emergency response and holds regular meetings on the 1st and 3rd Tuesday of each month.",
  "source": "Verified from official website, Google Business listing, and Facebook page",
  "phone": "(606) 843-2252",
  "email": "crossroads@crossroadsvfd.com",
  "website": "https://www.crossroadsvfd.com/",
  "address1": "7274 KY-490",
  "city": "East Bernstadt",
  "state": "KY",
  "county": "Laurel",
  "postal_code": "40729",
  "hours_of_operation": "24 hours a day, 7 days a week for emergency response",
  "is_emergency_service": true,
  "is_24_hour_service": true,
  "eligibility_requirements": "Emergency services available to all residents in Northern Laurel County service area",
  "populations_served": "Residents of Northern Laurel County, Kentucky",
  "cost_information": "Emergency fire response services provided at no cost to residents",
  "languages_available": "English",
  "notes": "VERIFIED INFORMATION: All contact information verified on 2024-01-15. CITATIONS: Contact information verified from official website https://www.crossroadsvfd.com/directions-contactinfo.php. Phone number (606) 843-2252 confirmed from official website, Google Business listing, and multiple directory listings. Address 7274 KY-490, East Bernstadt, KY 40729 verified from official website, Google Maps, and multiple sources. Email crossroads@crossroadsvfd.com verified from official website and Facebook page. Department serves Northern Laurel County for over 35 years, named in honor of Chief Basil Vaughn who died in 1987. Leadership includes Chief Gary Woods, Deputy Chief Gerald Kerler, Captain Justin Noe, and Lieutenants Andrew Branson and David Mathes. Department holds meetings 1st and 3rd Tuesday of each month. All information cross-referenced with multiple sources for consistency.",
  "service_type_ids": [14]
}
