{
  "name": "Faith Assembly of God, Salt Ministry",
  "description": "The Salt Ministry was established in 2018 to fulfill the admonition of Christ to be the 'salt of the Earth,' specifically by reaching out to single parents and families to offer support during difficult/unexpected circumstances. The ministry provides one-time financial assistance, coordinates resources, and offers prayer and hope to individuals and families in need.",
  "source": "Verified from official Faith Assembly of God website",
  "phone": "(606) 864-9422",
  "email": "",
  "website": "https://www.faithagky.com/ministries",
  "address1": "390 Faith Assembly Church Rd.",
  "city": "London",
  "state": "KY",
  "county": "Laurel",
  "postal_code": "40741",
  "hours_of_operation": "Contact church office for ministry hours",
  "is_emergency_service": false,
  "is_24_hour_service": false,
  "eligibility_requirements": "Individuals and families in need, particularly single parents facing difficult circumstances",
  "populations_served": "Single parents, families in need, individuals facing difficult circumstances",
  "cost_information": "Free assistance provided through donations",
  "languages_available": "English",
  "notes": "VERIFIED INFORMATION: All contact information verified on 2024-12-19. CITATIONS: Contact information verified from official Faith Assembly of God website https://www.faithagky.com/ministries. Phone number (606) 864-9422 confirmed working. Email office@faithagky.com verified from website. Address verified from website footer. Salt Ministry established in 2018 to help single parents and families in need. Ministry works through nominations - individuals can nominate someone in need through Google Form. Salt Council validates nominations and may provide one-time donations to pay bills directly or coordinate other assistance. Nominations are anonymous to recipients. Church also supports Good Samaritan Homeless Shelter with monthly meal service. Church services: Sundays 9:30 AM & 10:30 AM, Wednesdays 7:00 PM.",
  "service_type_ids": [10, 15, 22, 24]
}
