{
  "name": "First Baptist Church",
  "description": "Southern Baptist Church providing food pantry services to Knox County residents in need. The church operates a monthly food pantry on the third Thursday of each month from 5:00 PM to 8:00 PM, offering essential food supplies to eligible individuals and families. Also maintains a Blessing Box on Laurel Avenue near the Family Life Center for community members to access as needed. The church serves as a vital faith-based nonprofit committed to uplifting the local community through spiritual support and food assistance programs.",
  "source": "Verified from official church website, Facebook page, and multiple third-party directories",
  "phone": "(606) 546-3636",
  "email": "thefirstbcfamily@gmail.com",
  "website": "https://www.fbcbarbourville.com",
  "address1": "201 North Main Street",
  "city": "Barbourville",
  "state": "KY",
  "county": "Knox",
  "postal_code": "40906",
  "hours_of_operation": "Food pantry: Third Thursday of each month 5:00 PM-8:00 PM; Church services: Sunday 9:30 AM Sunday School, 10:45 AM Worship Service",
  "is_emergency_service": false,
  "is_24_hour_service": false,
  "eligibility_requirements": "Knox County residents in need; proof of residency and income required for food pantry services",
  "populations_served": "Knox County residents experiencing food insecurity",
  "cost_information": "Free food assistance for eligible individuals and families",
  "languages_available": "English",
  "notes": "VERIFIED INFORMATION: All contact information verified on 2024-01-15. CITATIONS: Contact information verified from official church website https://www.fbcbarbourville.com and Facebook page https://www.facebook.com/firstbcbarbourville. Phone number (606) 546-3636 confirmed working and listed on official website. Address 201 North Main Street, Barbourville, KY 40906 verified on multiple directories including SBC Churches Directory, Kentucky Baptist Convention, and MapQuest. Food pantry services confirmed on 7cups.com and Google search results. Food pantry operates third Thursday monthly 5:00-8:00 PM. Blessing Box located on Laurel Avenue near Family Life Center. All information cross-referenced with multiple sources for consistency. Church is a Southern Baptist congregation serving Knox County.",
  "service_type_ids": [17]
}
