{
  "name": "Food for the Poor",
  "description": "Food for the Poor is a 501(c)(3) non-profit organization dedicated to feeding the hungry and fighting poverty in Latin America and the Caribbean. They prioritize the preservation of human dignity and compassionate care for those in need through sustainable, community-driven solutions. From 2019 to 2023, they provided 943 million meals and delivered $3.2 billion in aid. Their programs include hunger relief, water sanitation, health care, community development, education, child well-being, emergency response, agriculture, and economic empowerment. They operate the Angels of Hope child sponsorship program supporting over 8,479 children in 87 group homes across multiple countries.",
  "source": "Verified from official Food for the Poor website and multiple sources",
  "phone": "(800) 427-9104",
  "email": "info@foodforthepoor.org",
  "website": "https://www.foodforthepoor.org",
  "address1": "6401 Lyons Road",
  "city": "Coconut Creek",
  "state": "FL",
  "county": "Broward",
  "postal_code": "33073-3602",
  "hours_of_operation": "Monday-Friday 8:00 AM - 5:00 PM EST",
  "is_emergency_service": false,
  "is_24_hour_service": false,
  "eligibility_requirements": "Open to all donors and supporters",
  "populations_served": "Children, Families, Communities in Latin America and Caribbean",
  "service_types": [
    "Hunger Relief",
    "Food Security",
    "Child Sponsorship",
    "Water Sanitation",
    "Health Care",
    "Community Development",
    "Education",
    "Emergency Response",
    "Agriculture",
    "Economic Empowerment",
    "International Aid",
    "Donor Services"
  ],
  "languages": ["English", "Spanish"],
  "accessibility_features": ["Phone support", "Online resources", "Multi-language support"],
  "fees": "Free services for beneficiaries, donation-based funding",
  "insurance_accepted": "Not applicable",
  "notes": "Food for the Poor is a major international charity with a 3-star rating from Charity Navigator. They focus on sustainable solutions to poverty and hunger, working with in-country partners. Their Angels of Hope program supports abandoned, orphaned, and neglected children. They provide humanitarian aid, build homes, and offer various sponsorship opportunities. Tax ID: #59-2174510.",
  "verification_status": "Verified",
  "last_verified": "2025-01-27"
}
