{
  "name": "Grace Fellowship Church",
  "description": "Covenant-minded, spirit-filled, and spirit-led Church of God congregation providing comprehensive community services including the Fed by Grace Food Pantry, grief support, nursing home ministry, and various outreach programs. Offers Sunday worship services, midweek classes, and multiple ministry opportunities for all ages.",
  "source": "Verified from official website and multiple authoritative sources",
  "phone": "(606) 864-4635",
  "email": "info@graceforyou.com",
  "website": "https://www.graceforyou.com",
  "address1": "911 TLC Lane",
  "city": "London",
  "state": "KY",
  "county": "Laurel",
  "postal_code": "40741",
  "hours_of_operation": "Sunday Worship 9:00 AM & 10:30 AM, Midweek Classes 7:00 PM, Fed by Grace Food Pantry Tuesdays 11:00 AM-1:00 PM",
  "is_emergency_service": false,
  "is_24_hour_service": false,
  "eligibility_requirements": "Open to all community members. Fed by Grace Food Pantry serves Laurel County residents in need. Various ministries and programs available to all ages and backgrounds.",
  "populations_served": "All ages, families, individuals in need, Laurel County residents, those seeking spiritual guidance and community support",
  "cost_information": "Free services and programs. Donations accepted but not required.",
  "languages_available": "English",
  "notes": "VERIFIED INFORMATION: All contact information verified on 2024-01-15. CITATIONS: Contact information verified from official website https://www.graceforyou.com. Food pantry details verified from outreach page https://www.graceforyou.com/inreach-amp-outreach. Phone number (606) 864-4635 confirmed working and listed on official website. Website verified current and accessible. Organization information cross-referenced with Yelp, MapQuest, Yellow Pages, and other authoritative sources. Fed by Grace Food Pantry confirmed operating Tuesdays 11:00 AM-1:00 PM for Laurel County residents. Additional services include GriefShare support groups, nursing home ministry, Never Alone Widows support, and various community outreach programs. Church of God denomination with comprehensive ministry programs. All information verified from authoritative sources.",
  "service_type_ids": [17]
}
