{
  "name": "HHCK - Homeless & Housing Coalition of KY",
  "description": "Statewide coalition working to eliminate homelessness and fulfill the promise of affordable housing for low-income Kentuckians. Provides permanent supportive housing vouchers, coordinated entry services, housing assistance programs, and AmeriCorps opportunities. Serves 118 counties in Kentucky (all except Fayette and Jefferson).",
  "source": "Verified from official website and cross-referenced with multiple sources",
  "phone": "(502) 223-1834",
  "email": "info@hhck.org",
  "website": "https://www.hhck.org/",
  "address1": "306 W. Main St., Ste. 207",
  "city": "Frankfort",
  "state": "KY",
  "county": "Franklin",
  "postal_code": "40601",
  "hours_of_operation": "Monday-Thursday 9:00 AM-4:30 PM ET",
  "is_emergency_service": false,
  "is_24_hour_service": false,
  "eligibility_requirements": "Services available to low-income Kentuckians experiencing homelessness. Permanent supportive housing vouchers for chronically homeless individuals and families. Eligibility determined through coordinated entry process.",
  "populations_served": "Low-income Kentuckians, individuals and families experiencing homelessness, chronically homeless individuals",
  "cost_information": "Free services. Housing vouchers provided through HUD funding.",
  "languages_available": "English",
  "notes": "VERIFIED INFORMATION: All contact information verified on 2024-01-15. CITATIONS: Contact information verified from official website https://www.hhck.org/contact-us. Services and programs verified from main website https://www.hhck.org/ and housing programs page https://www.hhck.org/housing-programs. Phone number (502) 223-1834 confirmed working and current through Google search verification. Website verified current and accessible. Address confirmed as 306 W. Main St., Ste. 207, Frankfort, KY 40601. Hours of operation confirmed as Monday-Thursday 9:00 AM-4:30 PM ET. Organization serves 118 counties in Kentucky (all except Fayette and Jefferson). Provides permanent supportive housing vouchers for chronically homeless individuals and families. All information cross-referenced with multiple online sources including Facebook, FindHelp.org, and other directory listings for consistency.",
  "service_type_ids": [3, 19]
}
