{
  "name": "House of Hope Ministry",
  "description": "House of Hope Kentucky provides transitional housing and comprehensive support for single, homeless women in substance abuse recovery. The program offers a two-year residential experience with individual goal development, personal mentoring, and life skills training to help women become independent and self-sufficient. Upon graduation, permanent housing assistance is provided to ease transition back to mainstream living.",
  "source": "Verified from official website, Facebook page, and multiple online directories",
  "phone": "(502) 551-4270",
  "email": "houseofhopeky@aol.com",
  "website": "https://www.houseofhopeky.org",
  "address1": "1157 Dixie Hwy",
  "city": "Louisville",
  "state": "KY",
  "county": "Jefferson",
  "postal_code": "40210",
  "hours_of_operation": "Monday-Friday 8:00 AM-5:00 PM",
  "is_emergency_service": false,
  "is_24_hour_service": false,
  "eligibility_requirements": "Single, homeless women over age 18 who have completed a treatment program for substance abuse",
  "populations_served": "Single homeless women in substance abuse recovery",
  "cost_information": "Contact for specific cost information and available assistance",
  "languages_available": "English",
  "notes": "VERIFIED INFORMATION: All contact information verified on 2024-01-15. CITATIONS: Contact information verified from official website https://www.houseofhopeky.org. Phone number (502) 551-4270 confirmed from Google Business listing, Facebook page, and multiple directory listings. Address 1157 Dixie Hwy, Louisville, KY 40210 verified from official website, Google Maps, and Facebook page. Email houseofhopeky@aol.com verified from official website and Facebook page. Services and program details verified from official website description and Facebook page. Organization offers Intensive Outpatient Treatment Services (IOP) as noted on Facebook page. All information cross-referenced with multiple sources for consistency.",
  "service_type_ids": [18, 21, 19, 8]
}
