{
  "name": "Hunter Hills Elementary",
  "description": "Hunter Hills Elementary School is a public elementary school serving students in Pre-K through 5th grade in the Laurel County School District. The school provides comprehensive education with a focus on relationships, resilience, and recognition. Programs include Gifted & Talented education, special education services, and free/reduced lunch programs. The school serves 603 students with a student-teacher ratio of 13.7:1.",
  "source": "Verified from official school website, NCES database, and Facebook page",
  "phone": "(606) 862-4655",
  "email": "molly.barnett@laurel.kyschools.us",
  "website": "https://www.laurel.kyschools.us/o/hhes",
  "address1": "8325 South U.S. 25",
  "city": "Corbin",
  "state": "KY",
  "county": "Laurel",
  "postal_code": "40701",
  "hours_of_operation": "Monday-Friday 8:10 AM-3:05 PM",
  "is_emergency_service": false,
  "is_24_hour_service": false,
  "eligibility_requirements": "Open to all students in the Laurel County School District attendance zone",
  "populations_served": "Students in Pre-K through 5th grade",
  "cost_information": "Free public education, free/reduced lunch available for eligible students",
  "languages_available": "English",
  "notes": "VERIFIED INFORMATION: All contact information verified on 2024-01-15. CITATIONS: Contact information verified from official school website https://www.laurel.kyschools.us/o/hhes. Phone number (606) 862-4655 confirmed from NCES database, Google Business listing, and official website. Address 8325 South U.S. 25, Corbin, KY 40701 verified from NCES database, official website, and Google Maps. Email molly.barnett@laurel.kyschools.us verified from Facebook page. School hours updated to 8:10 AM-3:05 PM starting August 7th as noted on Facebook page. Enrollment data (603 students) and student-teacher ratio (13.7:1) verified from NCES database. School serves Pre-K through 5th grade with Gifted & Talented program available. All information cross-referenced with multiple sources for consistency.",
  "service_type_ids": [9]
}
