{
  "name": "Isaiah 58:10 Ministries & Outreach",
  "description": "Isaiah 58:10 Ministries & Outreach is a nonprofit organization dedicated to feeding the homeless in Laurel County and surrounding areas. The ministry provides sack lunches to the homeless through their Project PB&J program, serving London, Corbin, Manchester, Barbourville, East Bernstadt, Gray, Keavy, Woodbine, Williamsburg, Flat Lick, Middlesboro, and Lily areas. They also operate a soup kitchen in partnership with The Good Samaritan House in London, KY, open Monday, Tuesday, Thursday, Friday and Saturday from 11am-1pm. The organization offers resource lists for the homeless and food insecure, and maintains a greenhouse project to provide fresh vegetables to the community.",
  "source": "Verified from official website and Facebook page",
  "phone": "(502) 801-9119",
  "email": "Tracie@is5810.com",
  "website": "http://is5810.com/",
  "address1": "2102 Marydell Rd",
  "city": "London",
  "state": "KY",
  "county": "Laurel",
  "postal_code": "40741",
  "hours_of_operation": "Soup Kitchen: Monday, Tuesday, Thursday, Friday, Saturday 11:00 AM-1:00 PM",
  "is_emergency_service": false,
  "is_24_hour_service": false,
  "eligibility_requirements": "Open to homeless and food insecure individuals in the community",
  "populations_served": "Homeless individuals, food insecure families, low-income community members",
  "cost_information": "Free services - no cost to participants",
  "languages_available": "English",
  "notes": "VERIFIED INFORMATION: All contact information verified on 2025-01-27. CITATIONS: Contact information verified from official Facebook page https://www.facebook.com/is5810/ including phone (502) 801-9119 and email Tracie@is5810.com. Address 2102 Marydell Rd, London, KY 40741 verified from TaxExemptWorld.org. Website http://is5810.com/ confirmed working and current. Services and programs verified from official website including Project PB&J sack lunch program and soup kitchen partnership with Good Samaritan House. Service areas confirmed as Whitley County, Knox County, Laurel County, and Clay County from Facebook page. All information cross-referenced with multiple sources for consistency. Organization is a registered 501(c)(3) nonprofit.",
  "service_type_ids": [2, 4, 17]
}
