{
  "name": "KCEOC - Community Action Partnership",
  "description": "One of Kentucky's original 23 Community Action Agencies established in 1964, serving low-income individuals and families across 16 counties in eastern and central Kentucky. Provides comprehensive services including early childhood education, housing assistance, food pantries, emergency support, job training, senior services, and utility assistance. Operates Emergency Support Center and participates in Summer Food Service Program. Committed to helping people help themselves and creating positive community change.",
  "source": "Verified from official website and multiple online sources",
  "phone": "(606) 546-3152",
  "email": "",
  "website": "https://kceoc.org",
  "address1": "5448 North US HWY 25E",
  "city": "Gray",
  "state": "KY",
  "county": "Knox",
  "postal_code": "40734",
  "hours_of_operation": "Monday-Friday 8:00 AM-5:00 PM",
  "is_emergency_service": false,
  "is_24_hour_service": false,
  "eligibility_requirements": "Low-income individuals and families. Specific eligibility varies by program. Income guidelines determined by federal poverty levels. Services available to residents of 16 counties in eastern and central Kentucky.",
  "populations_served": "Low-income families, children, seniors, individuals experiencing homelessness, job seekers, families in need of utility assistance",
  "cost_information": "Most services are free or low-cost based on income eligibility. Some programs may have sliding scale fees.",
  "languages_available": "English",
  "notes": "VERIFIED INFORMATION: All contact information verified on 2025-01-16. CITATIONS: Contact information verified from official website https://kceoc.org/contact/. Services and programs verified from main website https://kceoc.org and programs page https://kceoc.org/community-services/. Phone number (606) 546-3152 confirmed working and current across multiple sources including Google search results, official website, and various directory listings. Website verified current and accessible. Address 5448 North US HWY 25E, Gray, KY 40734 confirmed on official website and Google Maps. Hours of operation Monday-Friday 8:00 AM-5:00 PM verified from multiple sources. Fax number 606-546-5057 confirmed on official website. Mailing address P.O. Box 490, Barbourville, KY 40906 confirmed on official website. Organization is one of Kentucky's original 23 Community Action Agencies established in 1964. Serves 16 counties in eastern and central Kentucky. Social media presence confirmed: Facebook (@KCEOC1), LinkedIn, YouTube. All information cross-referenced with multiple sources including FindHelp.org, CAPKY network listing, and various government documents.",
  "service_type_ids": [1, 4, 7, 17, 19, 24]
}
