{
  "name": "ZeroV (Kentucky Coalition Against Domestic Violence)",
  "description": "ZeroV is the statewide coalition dedicated to creating safe lives and thriving futures for survivors of intimate partner violence and their children in Kentucky. Formerly known as the Kentucky Coalition Against Domestic Violence (KCADV), ZeroV supports Kentucky's 15 regional Domestic Violence Programs, providing free, confidential residential and non-residential services to survivors. The organization advocates for policy change, provides technical assistance and training, and works to abolish the social conditions that enable intimate partner violence.",
  "source": "Verified from official ZeroV website and multiple government sources",
  "phone": "(502) 209-5382",
  "email": "info@zerov.org",
  "website": "https://www.zerov.org/",
  "address1": "111 Darby Shire Circle",
  "city": "Frankfort",
  "state": "KY",
  "county": "Franklin",
  "postal_code": "40601",
  "hours_of_operation": "Monday-Friday 8:00 AM-5:00 PM",
  "is_emergency_service": false,
  "is_24_hour": false,
  "is_active": true,
  "eligibility_requirements": "Services available to all survivors of intimate partner violence in Kentucky. No income requirements. Services are free and confidential.",
  "populations_served": "Survivors of intimate partner violence, domestic violence victims, families affected by domestic violence",
  "cost_information": "All services are free and confidential",
  "languages_available": "English, interpretation services available",
  "notes": "VERIFIED INFORMATION: All contact information verified on 2024-01-15. CITATIONS: Contact information verified from official website https://www.zerov.org/. Organization rebranded from Kentucky Coalition Against Domestic Violence (KCADV) to ZeroV. Phone number (502) 209-5382 confirmed working. Website verified current and accessible. Address confirmed from multiple government sources including Kentucky.gov and Legislative Research Commission documents. Organization coordinates 15 regional domestic violence programs serving all 120 Kentucky counties. Fax number: 502-226-5382. All information cross-referenced with government sources and multiple online directories for consistency.",
  "service_type_ids": [12, 1, 5],
  "transition_status": "needs_review"
}
