{
  "name": "Kentucky Housing Corporation (KHC)",
  "description": "State housing agency created by the 1972 General Assembly to invest in affordable housing solutions throughout Kentucky. Self-supporting public corporation that offers comprehensive housing programs including homeownership assistance, rental housing financing, homeless programs, housing rehabilitation, and transitional housing. Has made homeownership possible for more than 76,000 Kentucky families and provides rental assistance to over 27,500 low-income Kentuckians.",
  "source": "Verified from official KHC website and multiple government sources",
  "phone": "(502) 564-7630",
  "website": "https://www.kyhousing.org",
  "address1": "1231 Louisville Road",
  "city": "Frankfort",
  "state": "KY",
  "county": "Franklin",
  "postal_code": "40601",
  "hours_of_operation": "Contact for specific hours",
  "is_emergency_service": false,
  "is_24_hours": false,
  "accepts_medicaid": false,
  "accepts_medicare": false,
  "accepts_private_insurance": false,
  "accepts_sliding_scale": false,
  "is_free": false,
  "languages": ["English", "Spanish"],
  "service_types": ["Transitional Housing", "Housing Assistance", "Homeownership Programs", "Rental Assistance", "Homeless Programs", "Housing Rehabilitation"],
  "categories": ["Housing"],
  "notes": "State housing agency providing comprehensive housing solutions. Offers programs for homebuyers, renters, homeless individuals, and those in need of housing assistance. Provides resources for Kentuckians in need including shelter/street outreach, eviction diversion, and legal assistance. Governed by 15-member Board of Directors and administratively attached to Kentucky Finance and Administration Cabinet.",
  "verification_status": "VERIFIED",
  "verification_notes": "Information verified from official KHC website. Organization is a state government agency with comprehensive housing programs and services. Contact information and address confirmed. Website provides extensive resources for housing assistance and programs."
}
