{
  "name": "London-Laurel County Chamber of Commerce",
  "description": "The London-Laurel County Chamber of Commerce is the most effective business organization committed to helping improve the economic climate and quality of life in the London and Laurel County areas. They work jointly with city and county governments on projects that make the community a better place for everyone to live and work. The Chamber processes hundreds of potential relocation inquiries annually and handles thousands of calls for general information about London and Laurel County. They provide business networking opportunities, economic development support, community information, and work closely with the London-Laurel County Tourist Commission and Industrial Development Authority.",
  "source": "Verified from official Chamber website and multiple sources",
  "phone": "(606) 864-4789",
  "email": "info@londonlaurelchamber.com",
  "website": "https://londonlaurelchamber.com",
  "address1": "409 South Main Street",
  "city": "London",
  "state": "KY",
  "county": "Laurel",
  "postal_code": "40741",
  "hours_of_operation": "Monday-Friday 9:00 AM - 5:00 PM",
  "is_emergency_service": false,
  "is_24_hour_service": false,
  "eligibility_requirements": "Open to businesses and individuals in London and Laurel County",
  "populations_served": "Businesses, Entrepreneurs, Community Members, Tourists",
  "service_types": [
    "Business Networking",
    "Economic Development",
    "Community Information",
    "Business Support",
    "Tourism Support",
    "Relocation Assistance",
    "Chamber Events",
    "Business Referrals"
  ],
  "languages": ["English"],
  "accessibility_features": ["Phone support", "Online resources", "In-person office"],
  "fees": "Membership fees vary by business type and size",
  "insurance_accepted": "Not applicable",
  "notes": "The Chamber is a non-profit organization supported by membership investments. They provide tornado relief resources and host signature events including the Annual Banquet and Golf Classic. The Chamber works with local government agencies and community organizations to promote economic growth and quality of life in the region.",
  "verification_status": "Verified",
  "last_verified": "2025-01-27"
}
