{
  "name": "New Frontiers: Clinical Counseling",
  "description": "New Frontiers: Clinical Counseling provides professional mental health counseling services for individuals, couples, and families. Services include individual therapy, couples counseling, family therapy, and specialized treatment for behavioral issues, substance abuse, trauma, and developmental disorders. The practice offers both in-person and telehealth sessions, with in-home and on-site counseling available. Currently providing telehealth-only services due to office closure.",
  "source": "Verified from Psychology Today profile, official website, and multiple online directories",
  "phone": "(606) 263-1339",
  "website": "https://www.therapyportal.com/p/william40701/",
  "address1": "105 N Kentucky Ave",
  "city": "Corbin",
  "state": "KY",
  "county": "Whitley",
  "postal_code": "40701",
  "hours_of_operation": "Contact for appointment scheduling - currently telehealth only",
  "is_emergency_service": false,
  "is_24_hour": false,
  "is_active": true,
  "eligibility_requirements": "All ages welcome - toddlers through elders. Accepts most major insurance plans and offers sliding scale fees.",
  "populations_served": "Individuals, couples, families, children, teens, adults, elders. Specializes in behavioral issues, family conflict, substance abuse, trauma, and developmental disorders.",
  "cost_information": "Accepts most major insurance plans including Anthem, Blue Cross/Blue Shield, Cigna, Humana, Medicaid, UnitedHealthcare. Offers sliding scale fees and free 15-minute consultation.",
  "languages_available": "English",
  "notes": "VERIFIED INFORMATION: All contact information verified on 2024-01-15. CITATIONS: Contact information and services verified from Psychology Today profile https://www.psychologytoday.com/us/therapists/new-frontiers-clinical-counseling-corbin-ky/174039. Phone number (606) 263-1339 confirmed working and listed consistently across multiple sources. Address verified from Psychology Today profile and MapQuest listings. Website verified current and accessible. Currently providing telehealth-only services as noted on Psychology Today profile. Services and specializations verified from official profile. Insurance acceptance and payment methods confirmed from Psychology Today listing. All information cross-referenced with Google search results and social media presence for consistency. Practice operated by William Aaron Stevens, LPCC, MEd with over 14 years of experience.",
  "service_type_ids": [2, 8, 20, 22]
}
