{
  "name": "Perfect Imperfections",
  "description": "Perfect Imperfections is a faith-based provider offering personalized mental health and drug & alcohol treatment services. Services include individual evaluation/assessment, 1-on-1 & group counseling, intensive outpatient classes, sober living with peer support, and Therapeutic Rehabilitation Program (TRP) for adults with serious mental illness. They accept Kentucky Medicaid and offer comprehensive recovery programs.",
  "source": "Verified from official website, Richmond Chamber of Commerce listing, and multiple online directories",
  "phone": "(859) 368-0003",
  "email": "info@perfectimperfectionsky.com",
  "website": "https://perfectimperfectionsky.com/",
  "address1": "2161 Lexington Rd.",
  "city": "Richmond",
  "state": "KY",
  "county": "Madison",
  "postal_code": "40475",
  "hours_of_operation": "Monday-Friday 9:00 AM-5:00 PM",
  "is_emergency_service": false,
  "is_24_hour": false,
  "is_active": true,
  "eligibility_requirements": "New participants must fully complete detox prior to admission. Strong commitment to adhering to program rules and fully engaging in all required activities is essential.",
  "populations_served": "Adults seeking mental health and substance abuse treatment, couples in recovery, individuals with serious mental illness (SMI)",
  "cost_information": "Accepts Kentucky Medicaid insurance. Contact for specific cost information and payment options.",
  "languages_available": "English",
  "notes": "VERIFIED INFORMATION: All contact information verified on 2024-01-15. CITATIONS: Contact information and services verified from official website https://perfectimperfectionsky.com/. Richmond location address verified from Richmond Chamber of Commerce listing https://web.richmondchamber.com/Substance-Abuse/Perfect-Imperfections-Ky-LLC-4776. Phone number (859) 368-0003 confirmed working and listed on official website. Website verified current and accessible. Hours of operation confirmed from multiple sources. Services and programs verified from main website content. All information cross-referenced with Google search results and social media presence for consistency. Organization has two locations: Richmond (2161 Lexington Rd.) and Lexington (1018 E New Circle Rd Suite 204).",
  "service_type_ids": [2, 8, 13, 20, 21]
}
