{
  "name": "Recovery Ridge",
  "description": "Recovery Ridge, LLC is a NARR certified Recovery Housing Organization dedicated to providing a supportive and structured environment for individuals recovering from alcohol and drug addiction. They offer intensive outpatient therapy and recovery housing accommodations with 12 Step structure and boundaries to help individuals avoid relapse during early stages of recovery.",
  "source": "Verified from official Recovery Ridge website and Facebook page",
  "phone": "(606) 260-5730",
  "website": "https://www.fusemedical.org/recovery-ridge",
  "address1": "Multiple locations in London, KY area",
  "city": "London",
  "state": "KY",
  "county": "Laurel",
  "postal_code": "",
  "hours_of_operation": "Not provided",
  "is_emergency_service": false,
  "is_24_hour_service": false,
  "eligibility_requirements": "Individuals recovering from alcohol and drug addiction seeking structured sober living environment",
  "populations_served": "Individuals in recovery from substance use disorders",
  "cost_information": "Affordable housing (specific costs not provided)",
  "languages_available": "English",
  "notes": "VERIFIED INFORMATION: All contact information verified on 2025-01-22. CITATIONS: Contact information verified from official website https://www.fusemedical.org/recovery-ridge and Facebook page. Phone number (606) 260-5730 confirmed from Facebook page. Website verified current and accessible. Organization is NARR certified Recovery Housing Organization. Multiple housing locations include: Parker House (187 Parker Road), Lucas House (2111 North Laurel Rd), Campground House (279 Campground School Rd), Doublewide (25 Waterworks Rd), OG House (190 Waterworks Rd), Price House (1567 County Farm Rd), Riddle House (1145 County Farm Rd), EB House (77 Fire Station Rd East Bernstadt), and Hope Springs House (8797 KY HWY 1232 Corbin). All information cross-referenced with official website and Facebook page for accuracy.",
  "service_type_ids": [21]
}
