{
  "name": "Redemption Road Recovery",
  "description": "Redemption Road Recovery is a non-profit, Christ-centered treatment facility for men with addiction disorders located in Heidrick, Kentucky. The facility offers comprehensive addiction treatment programs including residential treatment, partial hospitalization, intensive outpatient, and outpatient programs. Services include addiction treatment, counseling, transitional services, and support for men to regain custody of children, pursue education, and find employment. The facility has been serving the community since 2015 and maintains a lower recidivism rate than the state average.",
  "source": "Verified from official website and multiple resource directories",
  "phone": "(606) 545-5169",
  "website": "https://redemptionroadky.com/",
  "address1": "109 Morris Lane",
  "city": "Heidrick",
  "state": "KY",
  "county": "Knox",
  "postal_code": "40949",
  "hours_of_operation": "Monday-Friday 7:00 AM-5:00 PM - call for specific program hours",
  "is_emergency_service": false,
  "is_24_hour_service": false,
  "eligibility_requirements": "Men with addiction disorders seeking treatment, no out-of-pocket expenses, transportation provided",
  "populations_served": "Men with addiction disorders, individuals seeking substance abuse treatment",
  "cost_information": "No out-of-pocket expenses, accepts insurance and provides financial assistance",
  "languages_available": "English",
  "notes": "VERIFIED INFORMATION: All contact information verified on 2025-01-27. CITATIONS: Contact information verified from official website https://redemptionroadky.com/. Phone number (606) 545-5169 confirmed on website footer and Google search results. Address 109 Morris Lane, Heidrick, KY 40949 verified from website footer and Google Maps. Website verified current and accessible. Organization confirmed as Redemption Road Recovery, a non-profit Christ-centered treatment facility for men with addiction disorders. Services verified as residential treatment, partial hospitalization, intensive outpatient, and outpatient programs. CARF International accredited facility. Facebook page shows 830+ followers and active community engagement. All information cross-referenced with Google search results and resource directories for consistency.",
  "service_type_ids": [13, 21]
}
