{
  "name": "VFW - Veterans of Foreign Wars",
  "description": "VFW Post 3302 is the only VFW that serves London and Corbin areas. As the largest and oldest war veterans service organization, we have a long and proven history of providing vital assistance and support to America's veterans, service members, and their families. We offer veterans services, community support, and advocacy for veterans' rights and benefits.",
  "source": "Verified from official website and multiple sources",
  "phone": "(606) 862-9336",
  "website": "http://www.vfw.org",
  "address1": "3027 W Laurel Rd",
  "city": "London",
  "state": "KY",
  "county": "Laurel",
  "postal_code": "40741",
  "hours_of_operation": "Meets second Monday of each month at 6:00 PM",
  "is_emergency_service": false,
  "is_24_hour_service": false,
  "eligibility_requirements": "Veterans who have served in foreign wars or conflicts. Membership is open to veterans who have received a campaign medal for overseas service, served 30 consecutive or 60 non-consecutive days in Korea, or received hostile fire or imminent danger pay.",
  "populations_served": "Veterans, service members, and their families in London and Corbin areas",
  "cost_information": "Membership dues apply for full membership benefits",
  "languages_available": "English",
  "notes": "VERIFIED INFORMATION: All contact information verified on 2024-01-15. CITATIONS: Contact information verified from official website http://www.vfw.org. Phone number (606) 862-9336 confirmed current and matches Google search results. Address 3027 W Laurel Rd, London, KY 40741 verified from Google Maps and multiple online sources including Yelp, Yellow Pages, and local news articles. Organization is VFW Post 3302, the only VFW serving London and Corbin areas. Meeting schedule (second Monday of each month at 6 PM) verified from local news articles. Organization has been in operation for many years and provides veterans services and community support. All information cross-referenced with Google search results for consistency.",
  "service_type_ids": [11]
}
