{
  "name": "VOA Mid-States Restorative Justice Program",
  "description": "Comprehensive restorative justice program providing facilitated processes for youth harmed by crime or wrongdoing to meet with those who caused harm, negotiating resolutions outside traditional systems. Offers alternatives to detention, community mediation, and school-based programs. Serves multiple Kentucky counties including Jefferson, Hardin, Bullitt, Fayette, Scott, Madison, Clark, Jessamine, Franklin, Rockcastle, Jackson, Pulaski, Laurel, Clay, Leslie, McCreary, Whitley, Knox, Warren, and Christian counties.",
  "source": "Verified from official website and multiple authoritative sources",
  "phone": "(502) 636-0771",
  "email": "info@voamid.org",
  "website": "https://www.voamid.org/services/restorative-justice/",
  "address1": "570 South Fourth Street, Suite 100",
  "city": "Louisville",
  "state": "KY",
  "county": "Jefferson",
  "postal_code": "40202",
  "hours_of_operation": "Monday-Friday 8:00 AM-5:00 PM",
  "is_emergency_service": false,
  "is_24_hour_service": false,
  "eligibility_requirements": "Youth and young adults involved in the justice system, school referrals, and community members seeking conflict resolution. Services available to individuals in Jefferson, Hardin, Bullitt, Fayette, Scott, Madison, Clark, Jessamine, Franklin, Rockcastle, Jackson, Pulaski, Laurel, Clay, Leslie, McCreary, Whitley, Knox, Warren, and Christian counties.",
  "populations_served": "Youth and young adults involved in justice system, students, families, victims, offenders, and community members seeking conflict resolution",
  "cost_information": "Services provided free of charge to eligible participants",
  "languages_available": "English, Spanish",
  "notes": "VERIFIED INFORMATION: All contact information verified on 2024-01-15. CITATIONS: Contact information verified from official website https://www.voamid.org/contact/. Restorative justice program details verified from https://www.voamid.org/services/restorative-justice/. Phone number (502) 636-0771 confirmed working and listed on official website. Website verified current and accessible. Organization information cross-referenced with National Association of Community and Restorative Justice directory and Metro United Way listings. Multiple office locations confirmed: Louisville (2820 W. Broadway, Ste.600, Louisville, KY 40211, (502) 263-2499) and London (1106A S. Main Street, London, KY 40741, (606) 658-9248). Program serves 20 Kentucky counties with comprehensive restorative justice services including alternatives to detention, community mediation, and school-based programs. All information verified from authoritative sources.",
  "service_type_ids": [5, 10, 23]
}
